noccy80/mspdev/reference/MSP430ware/driverlib/5xx_6xx/rtc.c
    if (RTC_PRESCALE_0 == prescaleSelect){
        return ( HWREGB(baseAddress + OFS_RTCPS_L) );
    } else if (RTC_PRESCALE_1 == prescaleSelect){
        return ( HWREGB(baseAddress + OFS_RTCPS_H) );
    } else   {
        return ( 0) ;
    }
}

//*****************************************************************************
//
//! Sets the selected Prescaler value.
//!
//! \param baseAddress is the base address of the RTC module.
//! \param prescaleSelect is the prescaler to set the value for.
//!        Valid values are
//!        \b RTC_PRESCALE_0
//!        \b RTC_PRESCALE_1
//! \param prescaleCounterValue is the specified value to set the prescaler to;
//!       a valid value is any integer from 0-255.
//!        Modified bits are \b RTxPS of \b RTxPS register.
//!
//! This function sets the prescale counter value. Before setting the prescale
//! counter, it should be held.
//!
//! \return NONE
//
//*****************************************************************************
void RTC_setPrescaleCounterValue (unsigned int baseAddress,
    unsigned char prescaleSelect,
    unsigned char prescaleCounterValue)
{
    if (RTC_PRESCALE_0 == prescaleSelect){
        HWREGB(baseAddress + OFS_RTCPS_L) = prescaleCounterValue;
    } else if (RTC_PRESCALE_1 == prescaleSelect){
        HWREGB(baseAddress + OFS_RTCPS_H) = prescaleCounterValue;
    }
}

//*****************************************************************************
//
//! Enables selected RTC interrupt sources.
//!
//! \param baseAddress is the base address of the RTC module.
//! \param interruptMask is a bit mask of the interrupts to enable.
//!        Mask Value is the logical OR of any of the following
//!        \b RTC_TIME_EVENT_INTERRUPT - asserts when counter overflows in 
//!             counter mode or when Calendar event condition defined by 
//!             defineCalendarEvent() is met.
//!        \b RTC_CLOCK_ALARM_INTERRUPT - asserts when alarm condition in 
//!             Calendar mode is met.
//!        \b RTC_CLOCK_READ_READY_INTERRUPT - asserts when Calendar registers 
//!             are settled.
//!        \b RTC_PRESCALE_TIMER0_INTERRUPT - asserts when Prescaler 0 event 
//!             condition is met.
//!        \b RTC_PRESCALE_TIMER1_INTERRUPT - asserts when Prescaler 1 event 
//!             condition is met.
//!        \b RTC_OSCILLATOR_FAULT_INTERRUPT (RTC_B ONLY) - asserts if there is 
//!             a problem with the 32kHz oscillator, while the RTC is running.
//!
//! This function enables the selected RTC interrupt source.  Only the sources
//! that are enabled can be reflected to the processor interrupt; disabled
//! sources have no effect on the processor.
//!
//! \return NONE
//
//*****************************************************************************
void RTC_enableInterrupt (unsigned int baseAddress,
    unsigned char interruptMask)
{
    if ( interruptMask & (RTCOFIE + RTCTEVIE + RTCAIE + RTCRDYIE) ){
        HWREGB(baseAddress + OFS_RTCCTL01_L) |=
            (interruptMask & (RTCOFIE + RTCTEVIE + RTCAIE + RTCRDYIE));
    }

    if (interruptMask & RTC_PRESCALE_TIMER0_INTERRUPT){
        HWREGB(baseAddress + OFS_RTCPS0CTL) &= ~(RT0PSIFG);
        HWREGB(baseAddress + OFS_RTCPS0CTL) |= RT0PSIE;
    }

    if (interruptMask & RTC_PRESCALE_TIMER1_INTERRUPT){
        HWREGB(baseAddress + OFS_RTCPS1CTL) &= ~(RT1PSIFG);
        HWREGB(baseAddress + OFS_RTCPS1CTL) |= RT1PSIE;
    }
}

//*****************************************************************************
//
//! Disables selected RTC interrupt sources.
//!
//! \param baseAddress is the base address of the RTC module.
//! \param interruptMask is a bit mask of the interrupts to disable.
//!        Mask Value is the logical OR of any of the following
//!        \b RTC_TIME_EVENT_INTERRUPT - asserts when counter overflows in 
//!             counter mode or when Calendar event condition defined by 
//!             defineCalendarEvent() is met.
//!        \b RTC_CLOCK_ALARM_INTERRUPT - asserts when alarm condition in 
//!             Calendar mode is met.
//!        \b RTC_CLOCK_READ_READY_INTERRUPT - asserts when Calendar registers 
//!             are settled.
//!        \b RTC_PRESCALE_TIMER0_INTERRUPT - asserts when Prescaler 0 event 
//!             condition is met.
//!        \b RTC_PRESCALE_TIMER1_INTERRUPT - asserts when Prescaler 1 event 
//!             condition is met.
//!        \b RTC_OSCILLATOR_FAULT_INTERRUPT (RTC_B ONLY) - asserts if there is 
//!             a problem with the 32kHz oscillator, while the RTC is running.
//!
//! This function disables the selected RTC interrupt source.  Only the sources
//! that are enabled can be reflected to the processor interrupt; disabled
//! sources have no effect on the processor.
//!
//! \return NONE
//
//*****************************************************************************
void RTC_disableInterrupt (unsigned int baseAddress,
    unsigned char interruptMask)
{
    if ( interruptMask & (RTCOFIE + RTCTEVIE + RTCAIE + RTCRDYIE) ){
        HWREGB(baseAddress + OFS_RTCCTL01_L) &=
            ~(interruptMask & (RTCOFIE + RTCTEVIE + RTCAIE + RTCRDYIE));
    }

    if (interruptMask & RTC_PRESCALE_TIMER0_INTERRUPT){
        HWREGB(baseAddress + OFS_RTCPS0CTL) &= ~(RT0PSIE);
    }

    if (interruptMask & RTC_PRESCALE_TIMER1_INTERRUPT){
        HWREGB(baseAddress + OFS_RTCPS1CTL) &= ~(RT1PSIE);
    }
}

//*****************************************************************************
//
//! Returns the status of the selected interrupts flags.
//!
//! \param baseAddress is the base address of the RTC module.
//! \param interruptFlagMask is a bit mask of the interrupt flags to return the
//!       status of.
//!        Mask Value is the logical OR of any of the following
//!        \b RTC_TIME_EVENT_INTERRUPT - asserts when counter overflows in 
//!             counter mode or when Calendar event condition defined by 
//!             defineCalendarEvent() is met.
//!        \b RTC_CLOCK_ALARM_INTERRUPT - asserts when alarm condition in 
//!             Calendar mode is met.
//!        \b RTC_CLOCK_READ_READY_INTERRUPT - asserts when Calendar registers 
//!             are settled.
//!        \b RTC_PRESCALE_TIMER0_INTERRUPT - asserts when Prescaler 0 event 
//!             condition is met.
//!        \b RTC_PRESCALE_TIMER1_INTERRUPT - asserts when Prescaler 1 event 
//!             condition is met.
//!        \b RTC_OSCILLATOR_FAULT_INTERRUPT (RTC_B ONLY) - asserts if there is 
//!             a problem with the 32kHz oscillator, while the RTC is running.
//!
//! This function returns the status of the interrupt flag for the selected
//! channel.
//!
//! \return A bit mask of the selected interrupt flag's status.
//
//*****************************************************************************
unsigned char RTC_getInterruptStatus (unsigned int baseAddress,
    unsigned char interruptFlagMask)
{
    unsigned char tempInterruptFlagMask = 0x0000;

    tempInterruptFlagMask |= (HWREGB(baseAddress + OFS_RTCCTL01_L)
                              & (interruptFlagMask
                                 & (RTCOFIFG + RTCTEVIFG + RTCAIFG + RTCRDYIFG)));

    if (interruptFlagMask & RTC_PRESCALE_TIMER0_INTERRUPT){
        if ( HWREGB(baseAddress + OFS_RTCPS0CTL) & RT0PSIFG){
            tempInterruptFlagMask |= RTC_PRESCALE_TIMER0_INTERRUPT;
        }
    }

    if (interruptFlagMask & RTC_PRESCALE_TIMER1_INTERRUPT){
        if ( HWREGB(baseAddress + OFS_RTCPS1CTL) & RT1PSIFG){
            tempInterruptFlagMask |= RTC_PRESCALE_TIMER1_INTERRUPT;
        }
    }

    return ( tempInterruptFlagMask) ;
}

//*****************************************************************************
//
//! Clears selected RTC interrupt flags.
//!
//! \param baseAddress is the base address of the RTC module.
//! \param interruptFlagMask is a bit mask of the interrupt flags to be cleared.
//!        Mask Value is the logical OR of any of the following
//!        \b RTC_TIME_EVENT_INTERRUPT - asserts when counter overflows in 
//!             counter mode or when Calendar event condition defined by 
//!             defineCalendarEvent() is met.
//!        \b RTC_CLOCK_ALARM_INTERRUPT - asserts when alarm condition in 
//!             Calendar mode is met.
//!        \b RTC_CLOCK_READ_READY_INTERRUPT - asserts when Calendar registers 
//!             are settled.
//!        \b RTC_PRESCALE_TIMER0_INTERRUPT - asserts when Prescaler 0 event 
//!             condition is met.
//!        \b RTC_PRESCALE_TIMER1_INTERRUPT - asserts when Prescaler 1 event 
//!             condition is met.
//!        \b RTC_OSCILLATOR_FAULT_INTERRUPT (RTC_B ONLY) - asserts if there is 
//!             a problem with the 32kHz oscillator, while the RTC is running.
//!
//! This function clears the RTC interrupt flag is cleared, so that it no longer
//! asserts.
//!
//! \return NONE
//
//*****************************************************************************
void RTC_clearInterrupt (unsigned int baseAddress,
    unsigned char interruptFlagMask)
{
    if ( interruptFlagMask & (RTCOFIFG + RTCTEVIFG + RTCAIFG + RTCRDYIFG) ){
        HWREGB(baseAddress + OFS_RTCCTL01_L) &=
            ~(interruptFlagMask & (RTCOFIFG + RTCTEVIFG + RTCAIFG + RTCRDYIFG));
    }

    if (interruptFlagMask & RTC_PRESCALE_TIMER0_INTERRUPT){
        HWREGB(baseAddress + OFS_RTCPS0CTL) &= ~(RT0PSIFG);
    }

    if (interruptFlagMask & RTC_PRESCALE_TIMER1_INTERRUPT){
        HWREGB(baseAddress + OFS_RTCPS1CTL) &= ~(RT1PSIFG);
    }
}

//*****************************************************************************
//
//! Returns the given BCD value in Binary Format (RTC_B ONLY).
//!
//! \param baseAddress is the base address of the RTC module.
//! \param valueToConvert is the raw value in BCD format to convert to Binary.
//!        Modified bits are \b BCD2BIN of \b BCD2BIN register.
//!
//! This function converts BCD values to Binary format.
//!
//! \return The Binary version of the valueToConvert parameter.
//
//*****************************************************************************
unsigned int RTC_convertBCDToBinary (unsigned int baseAddress,
    unsigned int valueToConvert)
{
    HWREG(baseAddress + OFS_BCD2BIN) = valueToConvert;
    return ( HWREG(baseAddress + OFS_BCD2BIN) );
}

//*****************************************************************************
//
//! Returns the given Binary value in BCD Format (RTC_B ONLY).
//!
//! \param baseAddress is the base address of the RTC module.
//! \param valueToConvert is the raw value in Binary format to convert to BCD.
//!        Modified bits are \b BIN2BCD of \b BIN2BCD register.
//!
//! This function converts Binary values to BCD format.
//!
//! \return The BCD version of the valueToConvert parameter.
//
//*****************************************************************************
unsigned int RTC_convertBinaryToBCD (unsigned int baseAddress,
    unsigned int valueToConvert)
{
    HWREG(baseAddress + OFS_BIN2BCD) = valueToConvert;
    return ( HWREG(baseAddress + OFS_BIN2BCD) );
}

//*****************************************************************************
//
//Close the Doxygen group.
//! @}
//
//*****************************************************************************
